In [13]:
from datetime import datetime
from datetime import timezone
from zoneinfo import ZoneInfo

In [4]:
import pandas as pnd

In [71]:
cols = ["names"]
names= ["John", "Allan", "Tej"]
my_df = pnd.DataFrame(names)
my_df

       0
0   John
1  Allan
2    Tej

In [72]:
my_df.columns = cols
my_df

   names
0   John
1  Allan
2    Tej

In [73]:
my_df["names"][0]

'John'

In [74]:
my_df["program"] = ["ESD", "CSE", None]
my_df

   names program
0   John     ESD
1  Allan     CSE
2    Tej    None

In [75]:
my_df.fillna("Not Specified")

   names        program
0   John            ESD
1  Allan            CSE
2    Tej  Not Specified

In [76]:
my_df.iloc[2]

names       Tej
program    None
Name: 2, dtype: object

In [77]:
my_df["Student Id"] = ["ESD-10", "CSE-11", "MAE-12"]
my_df

   names program Student Id
0   John     ESD     ESD-10
1  Allan     CSE     CSE-11
2    Tej    None     MAE-12

In [78]:
my_df.set_index("Student Id")

            names program
Student Id
ESD-10       John     ESD
CSE-11      Allan     CSE
MAE-12        Tej    None

In [79]:
my_df.iloc[1]

names          Allan
program          CSE
Student Id    CSE-11
Name: 1, dtype: object

In [80]:
my_df["Mathematics"] = [75, 82, 94]
my_df["Science"] = [55, 67, 84]
my_df["English"] = [45, 77, 88]
my_df

   names program Student Id  Mathematics  Science  English
0   John     ESD     ESD-10           75       55       45
1  Allan     CSE     CSE-11           82       67       77
2    Tej    None     MAE-12           94       84       88

In [82]:
my_df['Average'] = my_df.iloc[:, 3:].mean(axis = 1)
my_df

   names program Student Id  Mathematics  Science  English    Average
0   John     ESD     ESD-10           75       55       45  58.333333
1  Allan     CSE     CSE-11           82       67       77  75.333333
2    Tej    None     MAE-12           94       84       88  88.666667

In [84]:
my_df.iloc[:, 3:].std()

Mathematics     9.609024
Science        14.571662
English        22.338308
Average        15.203557
dtype: float64